# Take imdb dataframe set to ssd, sample it and split it into train, test and validation data

In [1]:
import os, sys
os.chdir(sys.path[1])

In [1]:
import pandas as pd
from data_generator.dataset_generator import *

In [2]:
attr = 'age'
task = 'regression'

In [3]:
df = pd.read_csv('/home/nicoli/github/ssd_keras/dataset/csv/imdb_csv/imdb_'+ attr + '_'+ task+ '.csv', index_col=0)
df.head()

                                          image_name  class_id
0   imdb/79/nm0000379_rm537499648_1982-4-30_2006.jpg        24
1   imdb/50/nm0001650_rm281973760_1970-3-20_2005.jpg        35
2  imdb/38/nm0001638_rm3096615168_1941-6-10_1999.jpg        58
3  imdb/69/nm0358669_rm2779157248_1955-10-8_2008.jpg        53
4  imdb/07/nm0000207_rm2705034752_1980-2-12_1995.jpg        15

In [4]:
qtd = df.shape[0]
train_split, val_split, test_split = (0.7,0.1,0.2)
#classes = [[0,1],[1,0]]
target = ['class_id']#['class_id1', 'class_id2']

In [5]:
train_df, val_df, test_df = set_age_data_splits(df, qtd, train_split, val_split, test_split, target)

In [6]:
train_df.head()

                                          image_name  class_id
0   imdb/79/nm0000379_rm537499648_1982-4-30_2006.jpg        24
1   imdb/50/nm0001650_rm281973760_1970-3-20_2005.jpg        35
2  imdb/38/nm0001638_rm3096615168_1941-6-10_1999.jpg        58
3  imdb/69/nm0358669_rm2779157248_1955-10-8_2008.jpg        53
4  imdb/07/nm0000207_rm2705034752_1980-2-12_1995.jpg        15

In [7]:
val_df.head()

                                              image_name  class_id
33565  imdb/79/nm0000679_rm1699134976_1964-3-31_2011.jpg        47
33566  imdb/10/nm1982510_rm2091687936_1986-4-27_2005.jpg        19
33567   imdb/05/nm0000705_rm2457573888_1966-4-8_1998.jpg        32
33568  imdb/26/nm0005226_rm3259664896_1968-8-15_2009.jpg        41
33569  imdb/40/nm0001040_rm2044237824_1961-4-26_2004.jpg        43

In [8]:
test_df.head()

                                              image_name  class_id
38360  imdb/46/nm0636046_rm2974259968_1970-10-31_1997...        27
38361  imdb/10/nm0157410_rm2533726720_1974-2-19_2005.jpg        31
38362   imdb/21/nm0835021_rm2391072000_1918-2-8_1966.jpg        48
38363   imdb/08/nm0000408_rm834854144_1952-8-19_1987.jpg        35
38364  imdb/88/nm0913488_rm3372262144_1977-1-31_2003.jpg        26

In [9]:
titulo = str(qtd) + '-' + str(int(100*train_split)) + '-' + str(int(100*val_split)) + '-' + str(int(100*test_split))
titulo

'47950-70-10-20'

In [11]:

train_df.to_csv('/home/nicoli/github/ssd_keras/dataset/csv/imdb_csv/imdb_' + attr + '_' + task + '_train_split_' + titulo + '.csv', index=False)
val_df.to_csv('/home/nicoli/github/ssd_keras/dataset/csv/imdb_csv/imdb_' + attr +'_' + task +  '_val_split_' + titulo + '.csv',index=False)
test_df.to_csv('/home/nicoli/github/ssd_keras/dataset/csv/imdb_csv/imdb_' + attr + '_' + task + '_test_split_' + titulo + '.csv',index=False)

In [14]:
train_df.isnull().sum()

image_name    0
class_id1     0
class_id2     0
dtype: int64